robinolejnik/arduino-safetycar-boards/safetycar/boards.txt

safetycarzse.name=SafetyCarZSE
safetycarzse.vid.0=0x2341
safetycarzse.pid.0=0x0036
safetycarzse.vid.1=0x2341
safetycarzse.pid.1=0x8036
safetycarzse.vid.2=0x2A03
safetycarzse.pid.2=0x0036
safetycarzse.vid.3=0x2A03
safetycarzse.pid.3=0x8036
safetycarzse.upload_port.0.vid=0x2341
safetycarzse.upload_port.0.pid=0x0036
safetycarzse.upload_port.1.vid=0x2341
safetycarzse.upload_port.1.pid=0x8036
safetycarzse.upload_port.2.vid=0x2A03
safetycarzse.upload_port.2.pid=0x0036
safetycarzse.upload_port.3.vid=0x2A03
safetycarzse.upload_port.3.pid=0x8036
safetycarzse.upload_port.4.board=SafetyCarZSE

safetycarzse.upload.tool=avrdude
safetycarzse.upload.tool.default=avrdude
safetycarzse.upload.tool.network=arduino_ota
safetycarzse.upload.protocol=avr109
safetycarzse.upload.maximum_size=28672
safetycarzse.upload.maximum_data_size=2560
safetycarzse.upload.speed=57600
safetycarzse.upload.disable_flushing=true
safetycarzse.upload.use_1200bps_touch=true
safetycarzse.upload.wait_for_upload_port=true

safetycarzse.bootloader.tool=avrdude
safetycarzse.bootloader.tool.default=avrdude
safetycarzse.bootloader.low_fuses=0xff
safetycarzse.bootloader.high_fuses=0xd8
safetycarzse.bootloader.extended_fuses=0xcb
safetycarzse.bootloader.file=caterina/Caterina-Leonardo.hex
safetycarzse.bootloader.unlock_bits=0x3F
safetycarzse.bootloader.lock_bits=0x2F

safetycarzse.build.mcu=atmega32u4
safetycarzse.build.f_cpu=16000000L
safetycarzse.build.vid=0x2341
safetycarzse.build.pid=0x8036
safetycarzse.build.usb_product="Arduino Leonardo"
safetycarzse.build.board=AVR_LEONARDO
safetycarzse.build.core=arduino:arduino
safetycarzse.build.variant=SafetyCarZSE
safetycarzse.build.extra_flags={build.usb_flags}
